app/Controllers/Games.php

SELECT *
FROM `tb_games`
WHERE `tb_games`.`id` = '212'
---
    public function showFormEditGame( $id = null )
    {
        helper( 'form' );

        // call Model
        $gamesModel = new GamesModel();

        $data = [
            'title'     =>  'Edit Game',
            'gameEdit'      =>  $gamesModel->find( $id ),