app/Models/GamesModel.php

SELECT *
FROM `tb_games`
---
    public function selectGames( $id = false )
    {
        if ( $id === false ):
            return $this->findAll();

UPDATE `tb_games` SET `name` = 'Miguel Santisteban Capurro', `developer` = '', `price` = '10'
WHERE `id` = '212'
---
    public function updateGame( $id, $game )
    {
        $this->db->table( $this->table )->where( 'id', $id )->update( $game );